Config/Catalogs/DoorLockSystemParameters.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>DoorLockSystemParameters</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Hotel</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Hotels</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DoorLockSystemType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DoorLockSystems</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DoorLockSystemConnectionParameters</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ConnectionType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ConnectionTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ServerName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExchangeFolder</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Port</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BaudRate</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Parity</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ParityTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DataBits</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DataBits</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>StopBits</Name>
					<Type>
						<v8:Type>cfg:EnumRef.StopBits</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PCId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EncoderNumber</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>KeyCardType</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UserGroup</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AssignedAuthorizations</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeniedAuthorizations</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AllowDynamicAuthorizations</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>LicenseCode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DoGuestNamesTransliteration</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DoKeyCardsFromFoliosOnly</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UseRoomLockCodes</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SubtractMinutes</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AddMinutes</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>WriteTrack1</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>WriteTrack2</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Track1Length</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ReturnCardUID</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Separator</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ConvertUUIDToDecimal</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BytesToConvert</Name>
					<Type>
						<v8:Type>cfg:EnumRef.BytesToConvert</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CardVersion</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DefaultRoom</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Rooms</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IdentificationCardType</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.IdentificationCardTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DoNotIssuedIdentificationCards</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>InteractionParameters</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ExternalSystemInteractions</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Enums/DoorLockSystems.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>DoorLockSystems</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Adel</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Amadeus</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>AssaAbloyHospitality</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Bonwin</Name>
					<Comment>Bonwin</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>BonwinAutonomous</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Cisa</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FHBS</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FIAS</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>HAFELE</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Hoist</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>HSU</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>iLocks</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>iLocksOnline</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>InhovaMagnetic</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>InhovaProximity</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>IronLogic</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>KabaIlco</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>KabaSaflok</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Locstar</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Motolong</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>NORWEQMF</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Novilock</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OmniTec</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OnityHT22</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OnityHT24</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OnityHT28</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Orbita</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Orbita4X</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Orbita5X</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OZLocks</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>proUSB</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SaltoHotel</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>TimeLox2300</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ttLock</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>VingCard2100</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>VingCard2800</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>VingCardDavinci</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>VingCardVision</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Xeeder</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Catalogs/DoorLockSystemParameters/Forms/tcItemForm/Ext/Form/Module.bsl
#Region FormEventHandlers

// --------------------------------------------------------------------------------
&AtServer
Procedure OnCreateAtServer(pCancel, pStandardProcessing)
	If Parameters.Property("AvtoTest") Then
		If Parameters.AvtoTest Then
			Return;
		EndIf;	
	EndIf;
	// Let's set the properties of the form
	tcProtection.SetFormProperties(ThisObject);
	RefreshDisplay();
EndProcedure // OnCreateAtServer

// --------------------------------------------------------------------------------
&AtClient
Procedure NotificationProcessing(pEventName, pParameter, pSource)
	If pEventName = "Catalogs.DoorLockSystemParameters.Write" Then
		Read();	
	EndIf;
EndProcedure // NotificationProcessing

#EndRegion

#Region FormHeaderItemsEventHandlers

// --------------------------------------------------------------------------------
&AtClient
Procedure DoorLockSystemTypeOnChange(pItem)
	RefreshDisplay();	
EndProcedure // DoorLockSystemTypeOnChange

#EndRegion

#Region FormCommandsEventHandlers

// --------------------------------------------------------------------------------
&AtClient
Procedure CommandOpenSettings(pCommand)
	If Not Modified Then
		If ValueIsFilled(Object.DoorLockSystemType) Then
			If Object.DoorLockSystemType = PredefinedValue("Enum.DoorLockSystems.Hoist") Then
				OpenForm("DataProcessor.HoistDoorLockSystemDriver.Form.Settings", New Structure("DoorLockSystemParameters", Object.Ref));
			ElsIf Object.DoorLockSystemType = PredefinedValue("Enum.DoorLockSystems.BonwinAutonomous") Then
				OpenForm("CommonForm.tcSettingsBonwinAutonomous", New Structure("DoorLockSystemParameters", Object.Ref));
			ElsIf Object.DoorLockSystemType = PredefinedValue("Enum.DoorLockSystems.iLocks") Then
				OpenForm("CommonForm.tcSettingsILocks", New Structure("DoorLockSystemParameters", Object.Ref));
			ElsIf Object.DoorLockSystemType = PredefinedValue("Enum.DoorLockSystems.iLocksOnline") Then
				OpenForm("CommonForm.tcSettingsILocksOnline", New Structure("DoorLockSystemParameters", Object.Ref));
			ElsIf Object.DoorLockSystemType = PredefinedValue("Enum.DoorLockSystems.OZLocks") Then
				OpenForm("CommonForm.tcSettingsOZLocks", New Structure("DoorLockSystemParameters", Object.Ref));
			ElsIf Object.DoorLockSystemType = PredefinedValue("Enum.DoorLockSystems.KabaIlco") Then
				OpenForm("CommonForm.tcSettingsKabaIlco", New Structure("DoorLockSystemParameters", Object.Ref));
			ElsIf Object.DoorLockSystemType = PredefinedValue("Enum.DoorLockSystems.KabaSaflok") Then
				OpenForm("CommonForm.tcSettingsKabaSaflok",New Structure("DoorLockSystemParameters", Object.Ref));
			ElsIf Object.DoorLockSystemType = PredefinedValue("Enum.DoorLockSystems.TimeLox2300") Then
				OpenForm("CommonForm.tcSettingsTimeLox", New Structure("DoorLockSystemParameters", Object.Ref));
			ElsIf Object.DoorLockSystemType = PredefinedValue("Enum.DoorLockSystems.OmniTec") Then
				OpenForm("CommonForm.tcSettingsOmniTec", New Structure("DoorLockSystemParameters", Object.Ref));
			ElsIf Object.DoorLockSystemType = PredefinedValue("Enum.DoorLockSystems.Locstar") Then
				OpenForm("CommonForm.tcSettingsLocstar", New Structure("DoorLockSystemParameters", Object.Ref));
			ElsIf Object.DoorLockSystemType = PredefinedValue("Enum.DoorLockSystems.IronLogic") Then
				OpenForm("CommonForm.tcSettingsIronLogic", New Structure("DoorLockSystemParameters", Object.Ref));
			ElsIf Object.DoorLockSystemType = PredefinedValue("Enum.DoorLockSystems.FIAS") Then
				OpenForm("CommonForm.tcSettingsFIASLocks", New Structure("DoorLockSystemParameters", Object.Ref));
			ElsIf Object.DoorLockSystemType = PredefinedValue("Enum.DoorLockSystems.ttLock") Then
				OpenForm("CommonForm.tcSettingsttLocks", New Structure("DoorLockSystemParameters", Object.Ref));
			ElsIf Object.DoorLockSystemType = PredefinedValue("Enum.DoorLockSystems.proUSB") Then
				OpenForm("CommonForm.tcSettingsProUSB", New Structure("DoorLockSystemParameters", Object.Ref));
			ElsIf Object.DoorLockSystemType = PredefinedValue("Enum.DoorLockSystems.HAFELE") Then
				OpenForm("CommonForm.tcSettingsHAFELE", New Structure("DoorLockSystemParameters", Object.Ref));
			ElsIf Object.DoorLockSystemType = PredefinedValue("Enum.DoorLockSystems.NORWEQMF") Or Object.DoorLockSystemType = PredefinedValue("Enum.DoorLockSystems.FHBS") Then
				OpenForm("CommonForm.tcSettingsNORWEQMF", New Structure("DoorLockSystemParameters", Object.Ref));
			ElsIf Object.DoorLockSystemType = PredefinedValue("Enum.DoorLockSystems.Novilock") Then
				OpenForm("CommonForm.tcSettingsNovilock", New Structure("DoorLockSystemParameters", Object.Ref));
			ElsIf Object.DoorLockSystemType = PredefinedValue("Enum.DoorLockSystems.InhovaMagnetic") Or
				  Object.DoorLockSystemType = PredefinedValue("Enum.DoorLockSystems.InhovaProximity") Then
				OpenForm("CommonForm.tcSettingsInhova", New Structure("DoorLockSystemParameters", Object.Ref));
			EndIf;
		EndIf;
	Else
		tcCommonFunctionOnClientServer.TextMessage(NStr("en = 'All changes must be saved!'; de = 'Alle änderungen müssen gespeichert werden!'; ru = 'Все изменения должны быть сохранены!'"));	
	EndIf;
EndProcedure // CommandOpenSettings

#EndRegion

#Region Private

// -----------------------------------------------------------------------------
&AtServer
Procedure RefreshDisplay()
	If ValueIsFilled(Object.DoorLockSystemType) Then
		If Object.DoorLockSystemType = PredefinedValue("Enum.DoorLockSystems.BonwinAutonomous") Or 
		   Object.DoorLockSystemType = PredefinedValue("Enum.DoorLockSystems.iLocks") Or 
		   Object.DoorLockSystemType = PredefinedValue("Enum.DoorLockSystems.iLocksOnline") Or 
		   Object.DoorLockSystemType = PredefinedValue("Enum.DoorLockSystems.OZLocks") Or 
		   Object.DoorLockSystemType = PredefinedValue("Enum.DoorLockSystems.KabaIlco")Or 
		   Object.DoorLockSystemType = PredefinedValue("Enum.DoorLockSystems.KabaSaflok")Or
		   Object.DoorLockSystemType = PredefinedValue("Enum.DoorLockSystems.TimeLox2300") Or 
		   Object.DoorLockSystemType = PredefinedValue("Enum.DoorLockSystems.OmniTec") Or
		   Object.DoorLockSystemType = PredefinedValue("Enum.DoorLockSystems.Locstar") Or
		   Object.DoorLockSystemType = PredefinedValue("Enum.DoorLockSystems.IronLogic") Or
		   Object.DoorLockSystemType = PredefinedValue("Enum.DoorLockSystems.FIAS") Or
		   Object.DoorLockSystemType = PredefinedValue("Enum.DoorLockSystems.ttLock") Or
		   Object.DoorLockSystemType = PredefinedValue("Enum.DoorLockSystems.proUSB") Or
		   Object.DoorLockSystemType = PredefinedValue("Enum.DoorLockSystems.HAFELE") Or
		   Object.DoorLockSystemType = PredefinedValue("Enum.DoorLockSystems.NORWEQMF") Or
		   Object.DoorLockSystemType = PredefinedValue("Enum.DoorLockSystems.FHBS") Or
		   Object.DoorLockSystemType = PredefinedValue("Enum.DoorLockSystems.Novilock") Or
		   Object.DoorLockSystemType = PredefinedValue("Enum.DoorLockSystems.InhovaMagnetic") Or
		   Object.DoorLockSystemType = PredefinedValue("Enum.DoorLockSystems.InhovaProximity") Then
			Items.Group_Main.Enabled = False;
		Else
			Items.Group_Main.Enabled = True;
		EndIf;
	Else
		Items.Group_Main.Enabled = True;
	EndIf;
EndProcedure // RefreshDisplay

#EndRegion
